{
	"2023": {
		"VERB Interactive": [
			{
				"title": "Ferries Rebuild",
				"image": "/images/ferries.jpg",
				"content": "<p>I collaborated with a team consisting of six other developers under the guidance of a team lead. Our directive was to undertake a comprehensive overhaul of the VERB's <a href=\"#verb-ferries\">Ferries</a> application, essentially embarking on a redevelopment from the ground up.</p><p>My main focus during this project was front-end development, where I architected and implemented various components, pages, forms, and intricate user interfaces to handle complex data. Many of these user interfaces demanded intricate state management, while others necessitated client side data sorting and filtering.</p>",
				"technologies": ["React", "REST", "Tailwind CSS", "JavaScript", "HTML", "SCSS"]
			},
			{
				"title": "Voyages - Indegenous Tourism Australia",
				"image": "/images/voyages.jpg",
				"content": "<p>The Voyages website offers users the convenience of booking vacations while presenting an array of accommodation choices and exciting opportunities to explore renowned destinations across Australia.</p><p>In my role on this web project, I was responsible for implementing updates in alignment with the comprehensive project roadmap. This included the meticulous reconstruction of specific sections on the site, ensuring seamless integration with the pre-existing platform.</p><blockquote>We are focused on providing guests with enriching, memorable experiences which they would not be able to enjoy anywhere else in Australia. We are also committed to nurturing and sharing Australia's sensitive and complex eco and cultural destinations and also to protecting them so that our guests can continue to enjoy them for years to come.</blockquote>",
				"technologies": ["React", "REST", "JavaScript", "HTML", "SCSS"]
			}
		]
	},
	"2022": {
		"VERB Interactive": [
			{
				"title": "The Asbury",
				"image": "/images/asbury.jpg",
				"content": "<p>I had the privilege of working on the implementation of a brand-new website for The Asbury Park Hotel, a sophisticated establishment showcasing luxurious accommodations and a dynamic array of events within the vibrant locale of Asbury Park, New Jersey. This digital platform allows users check room availability and make reservations at this prestigious hotel.</p><p>Throughout this project, I collaborated closely with a dedicated team of four other skilled developers, playing a pivotal role in shaping the user interface to perfection. My contributions encompassed the creation and implementation of numerous UI components. A notable highlight I completed is the development of a sophisticated <a target=\"_blank\" href=\"https://www.theasburyhotel.com/things-to-do/events-calendar\" rel=\"no-referrer\">events calendar</a>, a versatile tool that not only showcases upcoming events but also provides intuitive filtering options based on event types and available venues.</p>",
				"technologies": ["React", "NextJS", "WordPress", "JavaScript", "HTML", "SCSS"]
			},
			{
				"title": "Cruise Ship Navigator",
				"image": "/images/cruise-ship-map.jpg",
				"content": "<p>I participated in the development of a cutting-edge application, aimed at creating an interactive world map that showcases cruise liners and their destinations across the globe.</p><p>The Cruise Ship Navigator application offers users the opportunity to track the approximate real-time location of cruise ships and explore the various ports of call along their voyage itinerary. Detailed information about any of these destinations is easily accessible by clicking on the corresponding port on the map.</p><p>Our application effortlessly displayed over a thousand locations for approximately 50 cruise ships, ensuring smooth and lag-free performance. I played a significant role in optimizing the application as well as implementing the user interface, resulting in a remarkably swift and polished final product.</p>",
				"technologies": ["React", "Redux", "MapBox", "REST", "JavaScript", "HTML", "SCSS"]
			}
		]
	},
	"2021": {
		"VERB Interactive": [
			{
				"title": "Ferries",
				"image": "/images/ferries.jpg",
				"content": "<p>As a part of the \"Ferries\" development team, I was actively involved in enhancing features and fixing issues within VERB's Ferries application, a ferry travel booking system that is currently serving numerous clients. The Ferries application serves as a comprehensive solution for users seeking to discover, reserve, and complete payments for  passenger and vehicle ferry journeys.</p><p>My work on the project encompassed several aspects:</p><ul><li>Feature Enhancements: We consistently strived to elevate the user experience by introducing new and improved features. These enhancements included but were not limited to refining the booking process, streamlining navigation, and offering additional customization options for users.</li><li>Bug Fixes: We were dedicated to maintaining a bug-free environment within the application. Our team vigilantly identified and resolved any issues that users encountered, ensuring that the application's functionality remained smooth and dependable.</li><li>Client Customization: Recognizing the diverse requirements of multiple clients, we worked on providing options for customizing the application's interface and functionality. This allowed our clients to tailor the Ferries app to their specific needs and branding.</li><li>Payment Integration: Secure and efficient payment processing was instrumental in ensuring that the payment systems were not only seamless but also highly secure.</li></ul><p>Our efforts were aimed at making the Ferries application a reliable, user-friendly, and adaptable solution for clients and their customers, ensuring that travelers could easily find, book, and pay for their ferry journeys with convenience and peace of mind.</p>",
				"technologies": ["React", "Redux", "REST", "JavaScript", "HTML", "SCSS"]
			}
			
		],
		"Ironclad Web Technologies": [
			{
				"title": "Threaded Article Comments",
				"image": "/images/comments.jpg",
				"content": "<p>In this contract/remote role, I was tasked with a stimulating project: architecting a comments system akin to Reddit, using React and Laravel. My proficiency in the MVC pattern facilitated a seamless transition to Laravel, dovetailing well with my existing interest in learning and working with React as a front end library.</p><p>Reporting directly to the CTO, I effectively translated their project visions into tangible outcomes within a remote work setup. Leveraging my comprehensive experience as a full stack developer, I delivered the finished project punctually, maintaining cost-efficiency while requiring minimal supervision.</p><p>The article comments system functions in the following manner:</p><ul><li>When a user is perusing an article on the website, they have the option to include their own commentary beneath the article.</li><li>Users are permitted to engage in discussions by responding to comments made by other users.</li><li>Users have the ability to express their approval or disapproval of another user's comment through the upvoting and downvoting options.</li><li>In the event that someone responds to a user's comment, the original user will be notified that there has been a response.</li></ul>",
				"technologies": ["React", "REST", "PHP", "Laravel", "Model View Controller", "Eloquent", "Object Relational Mapping" , "JavaScript", "HTML", "SCSS"]
			}
		]
	},
	"2020": {
		"ICS Creative Agency": [
			{
				"title": "Eastern Charlotte Waterways - Climate Change Hub",
				"image": "/images/swnbclimate.jpg",
				"content": "<p>This project involved the creation of a website for Eastern Charlotte Waterways Inc., as per their request for an online platform to showcase their work, achievements and solutions. Upon receiving the approved design concepts from our dedicated design team, I developed the website utilizing a combination of WordPress, PHP, HTML, JavaScript, and CSS.</p><blockquote>Eastern Charlotte Waterways Inc. is a not-for-profit, environmental resource and research centre located in Blacks Harbour, New Brunswick. Since 2013, ECW has worked alongside communities in southwestern New Brunswick to mitigate and adapt to climate change.</blockquote><p>The resulting website serves as a valuable resource, granting public access to climate-related information and facilitating the development of a collective regional approach to addressing climate change. It offers insights into the strategies adopted by New Brunswick communities in their efforts to enhance climate resilience.</p>",
				"technologies": ["PHP", "WordPress", "JavaScript", "HTML", "SCSS", "Responsive Design"]
			},
			{
				"title": "Vito's Restauant",
				"image": "/images/vitos.jpg",
				"content": "<p>I had the privilege of bringing to life a new website for Vito's Restaurant. In collaboration with ICS's design team, I translated mockups and image concepts into a fully functional website that embodies modern web standards.</p><p>This mobile-friendly website has been thoughtfully crafted to guarantee a smooth and enjoyable user experience across a range of devices. The website includes of a comprehensive menu, allowing visitors to explore the delightful offerings of Vito's Restaurant and place orders online. Furthermore, the website serves as a rich repository of the restaurant's history and insights into its dedicated founders.</p><p>The foundation of this website is built on the robust WordPress platform, augmented by the versatile Beaver Builder and Advanced Custom Fields plugins. This dynamic combination empowers our client to effortlessly manage and update various aspects of the website, such as page content and menu items, all within a user-friendly WordPress interface. This not only simplifies the maintenance process but also ensures that the website remains fresh and engaging for Vito's Restaurant's valued customers.</p>",
				"technologies": ["PHP", "WordPress", "Beaver Builder", "JavaScript", "HTML", "SCSS", "Responsive Design"]
			},
			{
				"title": "Deluxe French Fries",
				"image": "/images/deluxe-french-fries.jpg",
				"content": "<p>I had the pleasure of creating a brand new website for Deluxe French Fries in collaboration with ICS's design team. I transformed design mockups and image concepts into a fully operational website that adheres to contemporary web standards.</p><p>This website is designed with mobile users in mind, ensuring a seamless and enjoyable experience on various devices. It features a comprehensive menu that enables visitors to explore the delectable offerings of Deluxe French Fries and place orders online.</p><p>The foundation of this website is constructed using the robust WordPress platform, complemented by the versatile Advanced Custom Fields plugin. This powerful combination empowers our client to easily manage and update different elements of the website, such as page content and menu items, all through a user-friendly WordPress interface. This not only streamlines the maintenance process but also keeps the website consistently fresh and engaging for the esteemed customers of Deluxe French Fries Restaurant.</p>",
				"technologies": ["PHP", "WordPress", "JavaScript", "HTML", "SCSS", "Responsive Design"]
			}
		]
	},
	"2019": {
		"ICS Creative Agency": [
			{
				"title": "Mitchell McConnell Insurance",
				"image": "/images/mitchell-mcconnell.jpg",
				"content": "<p>I undertook the development of a new website for Mitchell McConnell Insurance, catering to their specific requirements for a updated online presence. The company recognized the need for a refreshed website, and the team at ICS was more than willing to assist.</p><p>The website required multiple pages to effectively communicate various facets of the services and insurance offerings as well as their distinct approach within the insurance industry. An integral part of the website was the \"About Us\" section, which featured comprehensive information about the team, including the contact details and individual biographies for each member.</p><p>In my role, I was responsible for translating the design concepts created by our design team into a fully functional website. I conducted rigorous quality assurance testing to ensure that the website performed flawlessly. Additionally, I conducted video walkthroughs to guide users on how to navigate and utilize the site effectively.</p>",
				"technologies": ["PHP", "WordPress", "JavaScript", "HTML", "SCSS", "Responsive Design"]
			},
			{
				"title": "ICSCreativeAgency.com",
				"image": "/images/ics-creative-agency.jpg",
				"content": "<p>During my tenure at ICS, my initial assignment was to become familiar the intricacies of HubSpot integration. Following this initial learning phase, I integrated ICS's company website with HubSpot's suite of customer relationship management and inbound marketing tools. This endeavor was pivotal in enhancing our ability to effectively manage customer interactions and employ sophisticated marketing strategies.</p><p>Moreover, as a dedicated team member, I took on the responsibility of making critical updates to the website. These updates spanned a spectrum of tasks such as updating page layouts, adding pages and integrating the site with Beaver Builder.</p><p>To empower the website management process, I facilitated the integration of the site with Beaver Builder, a highly intuitive and user-friendly What You See Is What You Get (WYSIWYG) editor designed specifically for WordPress. This integration provided our team with a powerful tool to swiftly  create, edit, and manage web content without the need for extensive technical expertise.</p><p>In sum, my multifaceted role at ICS extended beyond mere integration tasks. It encompassed enhancing website aesthetics, expanding its content and functionality, and integrating cutting-edge tools to streamline our web management processes, all contributing to a more effective and engaging online presence for the company.</p>",
				"technologies": ["PHP", "WordPress", "Responsive Design", "HubSpot", "JavaScript", "HTML", "SCSS"]
			}
		]
	},
	"2018": {
		"Correnet": [
			{
				"title": "SAWT - VOIP Cloud Provisioning Software",
				"image": "/images/sawt.jpg",
				"content": "<p>I played a pivotal role in the VOIP (Voice Over Internet Protocol) Configuration Import/Export software application called SAWT, a game-changer aimed at providing AT&T customers with a streamlined and efficient solution for managing their VOIP infrastructure. This venture unfolded in distinct phases, and my journey with SAWT began after the initial planning phase.</p><p>My primary responsibilities were to bring the project's vision to life by implementing the Minimum Viable Product (MVP) in line with the project's specifications. As the lead developer, I shouldered the bulk of the MVP implementation. In addition to coding, I actively engaged in collaborative planning meetings with AT&T stakeholders and business analysts at Correnet. Together, we meticulously dissected new feature requests, delving into the intricacies of how the software should function and its visual representation.</p><p>The SAWT cloud application serves as an indispensable tool for configuring and managing VOIP infrastructures. Its user interface revolves around a company listing with an intuitive sub-navigation system to access individual sites, each associated with specific location's physical VOIP setup. Users can seamlessly view and edit various aspects of their VOIP infrastructure, including individual telephone settings like voicemail and call forwarding, as well as site-wide global settings.  After importing data, the software presented users with a logically organized, hierarchical view of their VOIP configuration. Moreover, it featured an approval system that allowed supervisors to view and approve updates before the settings are actually saved to the configuration. The software's functionality extended to validating and then exporting the updated configurations back to the company's VOIP system, ensuring integration of the approved changes.</p><p>The back end of this application was meticulously crafted using Java code, which was built atop the Play MVC (Model/View/Controller) Framework and incorporated Hibernate ORM (Object-Relational Mapping) to interface with the MySQL database.</p><p>The user interface was developed using a combination of HTML, CSS, JavaScript, jQuery, and jqGrid. I crafted numerous custom user interfaces, at the request of stakeholders, that were designed to streamline the process of data entry, enabling a practical and efficient interface with the VOIP system.</p>",
				"technologies": ["React", "Redux", "REST", "JavaScript", "HTML", "SCSS"]
			}
		]
	},
	"2014" : {
		"Elandas": [
			{
				"title": "Win Tracker",
				"image": "/images/access-tracker.jpg",
				"content": "<p>During my tenure at Elandas, I undertook the development of a new software application tailored to enable users in monitoring select pharmaceuticals availability as well as coverage within specified health plans.</p><blockquote>Win Tracker is a solution to improve the information flow within an organization. Users can set up customized and up-to-date distribution lists, standardize messaging and ensure that announcements are shared appropriately throughout the organization.</blockquote><p>In collaboration with subject matter experts, I diligently incorporated intricate business rules and created an intuitive user interface. This interface allowed for efficient administrative data entry while presenting data to end users in an elegant and user-friendly manner.</p><p>Notably, the application displays map of the US, presenting data points and aggregated information to it's end users. Users have the ability to navigate to a more granular level, delving into state-specific details for a more comprehensive view.</p>",
				"technologies": ["Java", "jQuery", "Apache Web Server", "JavaScript", "HTML", "SCSS"]
			},
			{
				"title": "Pull-Through Express",
				"image": "/images/pull-through-express.jpg",
				"content": "<p>In my capacity as a Programmer/Analyst at Elandas, my duties included working on new features and bug fixes for Elandas's Pull-Through Express software.</p><p>The application stands as a pivotal sales and marketing tool tailored for professionals within the Life Science industry. Its functionality enables the customization of printed marketing materials. Noteworthy features of the software include real-time editing with live previews as well as a notification and approval system. The latter allows for the requisite approval of print materials by additional users prior to the initiation of the printing process.</p><p>Among my principal responsibilities was the enhancement of the software's user interface, aiming to elevate its overall usability.</p>",
				"technologies": ["Java", "jQuery", "Apache Web Server", "JavaScript", "HTML", "SCSS"]
			}
		]
	}
}